import mokose as MOKO

# =============================================================================
# BK_PRECISION_XLN3640 — Программируемый источник питания (BK Precision)
# Аналог для Hantek_HDP4000
# Подключение: USB-VISA
# =============================================================================

# Присвоение имени драйвера
PSU = "BK_PRECISION_XLN3640"

# --- Инициализация и сброс ---------------------------------------------------

idn = MOKO.Driver(PSU, "init")              # Идентификация

# --- Установка параметров ----------------------------------------------------
MOKO.Driver(PSU, "set", "voltage = 12.0")           # Напряжение 12.0 В
MOKO.Driver(PSU, "set", "# VSET 12")                # Прямая SCPI

MOKO.Driver(PSU, "set", "current = 1")              # Ограничение тока 1.5 А
MOKO.Driver(PSU, "set", "# ISET 1")                 # Прямая SCPI

# --- Управление выходом ------------------------------------------------------
MOKO.Driver(PSU, "set", "output = ON")              # Включение выхода
MOKO.Driver(PSU, "set", "# OUT 1")                  # Прямая SCPI

MOKO.Driver(PSU, "set", "output = OFF")             # Выключение выхода
MOKO.Driver(PSU, "set", "# OUT 0")                   # Прямая SCPI
