import mokose as MOKO
# =============================================================================
# Keithley_2110 — Прецизионный мультиметр (Keithley / Tektronix)
# Аналог для Hantek_HDM3075
# Подключение: USB-VISA
# =============================================================================

# Присвоение имени драйвера
DMM = "Keithley_2110"

# --- Инициализация и сброс ---------------------------------------------------
idn = MOKO.Driver(DMM, "init")               # Идентификация


# --- Конфигурация измерения тока ---------------------------------------------
MOKO.Driver(DMM, "set", "function = IDC")            # Режим: измерение постоянного тока
MOKO.Driver(DMM, "set", ":SENS:FUNC ''CURRent:DC''") # Прямая SCPI (Keithley синтаксис) заменяются " на ''

MOKO.Driver(DMM, "set", "range = 1")               # Предел измерения 1 А
MOKO.Driver(DMM, "set", "# SENS:CURR:DC:RANG 1")     # Прямая SCPI (Keithley синтаксис)

# --- Получение измерений -----------------------------------------------------
current = MOKO.Driver(DMM, "get", "read")            # Считывание усреднённого тока
current = MOKO.Driver(DMM, "get", "# READ?")    # Прямая SCPI
